# Pandas_basic03

---

In [1]:
# 필요 package import

import numpy as np
import pandas as pd

In [2]:
# 변수 실행시 마지막 변수만 보여주던 것을 모든 변수를 보여주도록 설정 변경

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

* 행과 열을 동시에 인덱싱 하는 구조는 기본 자료구조 인덱스와 차이가 있다.
    * df['열']
    * df[:'행'] - 슬라이싱이 반드시 필요하다.
    * df['열'][:'행']
    
    

## 데이터 프레임에서 인덱서 사용
### `loc`, `iloc` 속성을 사용하는 인덱싱

* pandas 패키지는 [행번호][열번호] 인덱싱 불가
    * `iloc[행번호][열번호]` 가능
    * `loc[행제목][열제목]` 가능  
    
    
    
* 인덱싱 값
    1. 인덱스 데이터(index, column name)
    2. 인덱스 데이터 슬라이스
    3. 같은 행 인덱스를 갖는 boolean 시리즈(행 인덱싱인 경우)
    4. 조건으로 추출 가능
    5. 위 값을 반환하는 함수
    
    
### `loc()`

In [6]:
# 예제 df 사용

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                 index=['a', 'b', 'c'],
                 columns=['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

* `loc()`
    * 인덱싱 값을 하나만 받는 경우

In [8]:
# 행 우선이므로, a행의 모든 열을 추출하게됨.

df.loc['a']
print(type(df.loc['a']))

A    10
B    11
C    12
D    13
Name: a, dtype: int32

<class 'pandas.core.series.Series'>

In [12]:
# 에러가 남
try :
    df.loc['A']
except Exception as e:
    print(type(e))

<class 'KeyError'>

* `loc()`는 행우선 인덱스를 한다.
* 위의 예제는 'A열의 모든 행을 출력하시오'라는 의미로 전달했지만,
* 'A행의 모든 열을 출력하시오'로 해석한다.
* 따라서 'A'행이 없으므로 Key Error가 발생한다.

In [20]:
# b행부터 c행의 모든 열 반환
df.loc['b':'c']
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [23]:
# 인덱서의 인덱스 값 : 리스트 사용 가능
# 반환값이 데이터 프레임 형태로 반환된다.

df.loc[['b', 'c']]
df.loc[['a', 'c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [24]:
# Boolean Series 행을 선택하는 인덱싱 값으로 쓸 수 있다.
# df 객체의 A열의 값 이 15보다 큰지 확인해 T/F로 반환된다.
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [25]:
# 원본 출력
df

# A열의 값이 15보다 큰 행을 추출하시오.
df.loc[df.A > 15]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
c  18  19  20  21

In [27]:
# 인덱스 대신 인덱스 값을 반환하는 함수 사용이 가능하다.

# 함수작성
def sel_row(df):
    return df.A > 15

# A 열의 값이 15보다 큰 행을 추출하시오.
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

In [28]:
# 예제 df 생성 2 (변수명 : df2)

df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4),
                  columns=['a', 'b', 'c', 'd'])
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [30]:
# 위치 인덱싱이어서 2번째 행이 출력
df2[1:2] 

# 값 인덱싱이어서 2번째 행까지 출력
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [35]:
# 인덱싱의 값으로 행과 열을 모두 받는 경우
# df.loc[행인덱스, 열인덱스]  # 라벨 인덱스
df2.loc[1, 'a']

14

In [44]:
df
# df 데이터 프레임의 a행의 B,C 열을 추출하시오
df.loc['a', 'B':'C']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

In [53]:
# a, b행의 모든 열을 df로 반환 1
df.loc['a': 'b']

# a, b행의 모든 열을 df로 반환 2
df.loc[['a', 'b']]

# a, b행의 B열을 시리즈로 반환
df.loc['a':'b', 'B']

# a, b행의 B열을 df 형태로 반환
df.loc[['a', 'b'], ['B']]

# a, b행의 B, D열을 df로 반환
df.loc[['a', 'b'], ['B', 'D']]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

a    11
b    15
Name: B, dtype: int32

    B
a  11
b  15

    B   D
a  11  13
b  15  17

### `iloc()`
* 라벨(name)이 아닌 위치를 나타내는 정수 인덱스만 받는다.
* 위치 정수값은 0부터 시작

In [54]:
df
df.iloc[0, 1] # 0행 1열

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

11

In [64]:
# df 형태로 반환 한다 - 슬라이싱 사용
df.iloc[0:2, 1:2] 

# 시리즈 형태로 반환
df.iloc[0:2, 1]

# df 형태로 반환
df.iloc[0:2, 1:2]

# 0행의 끝에서 2번째 열부터 끝열까지 반환
df.iloc[:, 2:]

    B
a  11
b  15

a    11
b    15
Name: B, dtype: int32

    B
a  11
b  15

    C   D
a  12  13
b  16  17
c  20  21

### 연습문제
1. 모든 행과 열에 라벨을 가지는 5*5 이상 크기의 데이터 프레임을 만든다. (최대한 간단한 코드로 작성)
2. 10가지 이상의 방법으로 특정한 행과 열을 추출해 볼 것.
    * 2번 작업을 진행하면서 주석으로 추출하는 내용을 정리할 것
3. 모든 인덱싱 방법을 사용할 것

In [67]:
test_df = pd.DataFrame(np.random.randn(5, 5), index=['a', 'b', 'c', 'd', 'e'],
                      columns=['A', 'B', 'C', 'D', 'E'])
test_df

          A         B         C         D         E
a -2.342704  0.813906  0.335808  0.114036 -0.024709
b  0.155483  0.228901 -0.669458  0.721518 -0.809958
c -1.799123  0.005888 -0.790802 -2.275170 -1.040675
d  0.118835 -0.792119  0.042747 -1.528870 -0.219604
e  0.009134 -2.132845  0.597766 -0.176033 -2.261155

In [97]:
# 1) a행의 모든 열을 추출
test_df.loc['a']

# 2) a행의 모든 열을 df로 추출
test_df.loc[['a']]

# 3) a, b행을 추출
test_df['a':'b']

# 4) C 열이 양수인 행만 추출
test_df[test_df.C >=0]

# 5) a행의 B열 값 추출
test_df.loc['a']['B']
test_df.iloc[0][1]

# 6) C열을 시리즈 객체로 추출
test_df.loc[:, 'C']
test_df.iloc[:, 2]

# 7) C열을 df 객체로 추출
test_df.loc[:, 'C':'C']

# 8) d행의 B, C열을 추출
test_df.loc[['d'], ['C', 'D']]

# 9) d행의 B, C열을 추출 - iloc
test_df.iloc[3:4, 2:4]

# 10) 짝수 열만
test_df.iloc[:, ::2]

A   -2.342704
B    0.813906
C    0.335808
D    0.114036
E   -0.024709
Name: a, dtype: float64

          A         B         C         D         E
a -2.342704  0.813906  0.335808  0.114036 -0.024709

          A         B         C         D         E
a -2.342704  0.813906  0.335808  0.114036 -0.024709
b  0.155483  0.228901 -0.669458  0.721518 -0.809958

          A         B         C         D         E
a -2.342704  0.813906  0.335808  0.114036 -0.024709
d  0.118835 -0.792119  0.042747 -1.528870 -0.219604
e  0.009134 -2.132845  0.597766 -0.176033 -2.261155

0.8139055111655564

0.8139055111655564

a    0.335808
b   -0.669458
c   -0.790802
d    0.042747
e    0.597766
Name: C, dtype: float64

a    0.335808
b   -0.669458
c   -0.790802
d    0.042747
e    0.597766
Name: C, dtype: float64

          C
a  0.335808
b -0.669458
c -0.790802
d  0.042747
e  0.597766

          C        D
d  0.042747 -1.52887

          C        D
d  0.042747 -1.52887

          A         C         E
a -2.342704  0.335808 -0.024709
b  0.155483 -0.669458 -0.809958
c -1.799123 -0.790802 -1.040675
d  0.118835  0.042747 -0.219604
e  0.009134  0.597766 -2.261155